# Brewfile

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

brew "bash"
brew "cmake"
brew "fish"
brew "gnupg"
brew "go"
brew "htop"
brew "pinentry-mac"
brew "python"
# brew "llvm"
brew "mas"
brew "msmtp"
brew "neofetch"
brew "neovim"
brew "node"
brew "openjdk"
brew "pandoc"
brew "tmux"
brew "wget"
brew "zoxide"

cask "1password"
# cask "bartender"
cask "calibre"
cask "discord"
cask "dotnet-sdk"
cask "firefox"
cask "font-fira-code"
cask "font-inter"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "google-drive"
cask "jetbrains-toolbox"
cask "kitty"
cask "macs-fan-control"
cask "mimestream"
cask "minecraft"
cask "monitorcontrol"
cask "protonvpn"
cask "raycast"
cask "rectangle"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "xquartz"

mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Accelerate", id: 1459809092
mas "Craft", id: 1487937127
mas "Developer", id: 640199958
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
