cosminalco.defaultpp
ms-python.python
ms-vscode.cpptools
matklad.rust-analyzer
James-Yu.latex-workshop
ms-toolsai.jupyter
ritwickdey.LiveServer
vscode-icons-team.vscode-icons
vscodevim.vim
zhuangtongfa.material-theme
GitHub.github-vscode-theme
sjhuangx.vscode-scheme
bradlc.vscode-tailwindcss